bit-finance/Reports/бит_УниверсальныйОтчетПоИсточникамДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УниверсальныйОтчетПоИсточникамДанных</Name>
		</Properties>
	</Report>
</MetaDataObject>

bit-finance/Catalogs/бит_НастройкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиОтчетов</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПараметровПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_УниверсальныйОтчетПоИсточникамДанных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыОтчета  = ОбязательныеПараметрыОтчета();
	
	// Перенесем параметры компоновки в служебную ТЗ.
	ПараметрыИсточника = ПараметрыОтчета.ПараметрыИсточника;
	Для каждого ПараметрИсточника Из ПараметрыИсточника Цикл
		ПараметрНастройки = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(НастройкиКомпоновкиДанных, ПараметрИсточника.ИмяПараметра);
		Если ПараметрНастройки <> Неопределено Тогда
			ПараметрИсточника.ЗначениеПараметра = ПараметрНастройки.Значение;		
		КонецЕсли;
	КонецЦикла;
	
	ДанныеПоИсточнику = ДанныеПоИсточнику(ПараметрыОтчета);
	ВнешниеНаборы	  = Новый Структура;
	Для каждого НаборДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		ВнешниеНаборы.Вставить(НаборДанных.ИмяОбъекта, ДанныеПоИсточнику);
	КонецЦикла;

	Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.УстановитьЗаголовкиПолей(СхемаКомпоновкиДанных, 
		НастройкиКомпоновкиДанных, ПараметрыОтчета);
	
	КомпоновщикМакета 		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

	бит_ОтчетыБФСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, 
		ДокументРезультат, ВспомогательныеПараметрыОтчета());

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НастройкаОтчета = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "НастройкаОтчета").Значение;
	Если НЕ ЗначениеЗаполнено(НастройкаОтчета) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
							НСтр("ru = 'Настройка отчета'; en = 'Report Setup'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере 						  = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере 			  = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик 		  = Истина;
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.ЗагрузитьНастройкиПриИзмененииПараметров();
	// См.еще:
	// БухгалтерскиеОтчетыВызовСервера.ПередЗагрузкойНастроекВКомпоновщик
	// Отчеты.РезультатыПроверкиУчета
	// Отчеты.ПраваРолей
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	РазрешеноИзменятьВарианты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.НастройкиОтчета, 
									"РазрешеноИзменятьВарианты", Ложь);
	
	Если РазрешеноИзменятьВарианты Тогда
		Форма.НастройкиОтчета.ФормаНастроекРасширенныйРежим = 1;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВыбратьНастройки", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СохранитьНастройки", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПоделитьсяНастройками", "Видимость", Ложь);
	
КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, Настройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	Схема			 = Неопределено;
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") ИЛИ Настройки = Неопределено Тогда
		Если Настройки = Неопределено Тогда
			ДополнительныеСвойстваНастроек = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
			НовыеНастройкиКД = КомпоновщикНастроек.Настройки;	
		Иначе
			ДополнительныеСвойстваНастроек = Настройки.ДополнительныеСвойства;
			НовыеНастройкиКД = Настройки;
		КонецЕсли;
		
		Если Форма.ТипФормыОтчета = ТипФормыОтчета.Основная
			И (Форма.РежимРасшифровки) Тогда 			
			ДополнительныеСвойстваНастроек.Вставить("ОтчетИнициализирован", Истина);
		КонецЕсли;	
				
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
		
		ПараметрНастройкаОтчета = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(НовыеНастройкиКД, "НастройкаОтчета").Значение;
		ФиксированныеПараметры = Новый Структура("НастройкаОтчета", ПараметрНастройкаОтчета);

		Если НЕ ЗначениеЗаполнено(ФиксированныеПараметры.НастройкаОтчета) Тогда
			ТекущийКлючСхемы = "бит_УниверсальныйОтчетПоИсточникамДанных";
		Иначе	
			ТекущийКлючСхемы = Строка(ФиксированныеПараметры.НастройкаОтчета.УникальныйИдентификатор());
			ОсновнойВариант  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФиксированныеПараметры.НастройкаОтчета, "ВариантОтчета");
			ТекущийКлючСхемы = ТекущийКлючСхемы + "/" + ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ОсновнойВариант.Получить());
		КонецЕсли;		
		ТекущийКлючСхемы = ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ТекущийКлючСхемы, 100);
		
		Схема = Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.СхемаКомпоновкиДанных(ФиксированныеПараметры);
		
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Форма, Схема, ТекущийКлючСхемы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
		
	ТекущийКлючСхемы = Неопределено;
	Схема			 = Неопределено;
	НастройкаОтчета  = Неопределено;

	Если НовыеНастройкиКД = Неопределено Тогда 
		НовыеНастройкиКД = КомпоновщикНастроек.Настройки;
	КонецЕсли;	
	
	// Тут обрабатывается ситуация, когда отчет открывается из форм справочника "Настройки отчета".
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") 
		И Контекст.Параметры.Свойство("НастройкаОтчета", НастройкаОтчета) И ЗначениеЗаполнено(НастройкаОтчета) Тогда

		НовыеНастройкиКД.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Ложь);
		
		ЗначениеПараметраДанныеОтчета = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НастройкаОтчета"));
		НастройкаДанныеОтчета = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ЗначениеПараметраДанныеОтчета.ИдентификаторПользовательскойНастройки);
		Если НастройкаДанныеОтчета <> Неопределено Тогда
			НастройкаДанныеОтчета.Значение = НастройкаОтчета;		
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеЗначения 	   = Неопределено;
	ФиксированныеПараметры = Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.ФиксированныеПараметры(
								НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД, ДоступныеЗначения);
								
	ПараметрНастройкаОтчета = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(НовыеНастройкиКД, "НастройкаОтчета").Значение;
	
	Если ТекущийКлючСхемы = Неопределено Тогда 
		Если НЕ ЗначениеЗаполнено(ФиксированныеПараметры.НастройкаОтчета) Тогда
			ТекущийКлючСхемы = "бит_УниверсальныйОтчетПоИсточникамДанных";
		Иначе	
			ТекущийКлючСхемы = Строка(ФиксированныеПараметры.НастройкаОтчета.УникальныйИдентификатор());
			ОсновнойВариант  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФиксированныеПараметры.НастройкаОтчета, "ВариантОтчета");
			ТекущийКлючСхемы = ТекущийКлючСхемы + "/" + ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ОсновнойВариант.Получить());
		КонецЕсли;		
		ТекущийКлючСхемы = ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ТекущийКлючСхемы, 100);
		
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			КлючСхемы = "";
			Схема = Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.СхемаКомпоновкиДанных(ФиксированныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийКлючСхемы <> Неопределено И ТекущийКлючСхемы <> КлючСхемы Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, Схема, КлючСхемы);
		
		ОтчетИнициализирован = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
									НовыеНастройкиКД.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь);
		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") И НЕ ОтчетИнициализирован Тогда
			Контекст.ВариантМодифицирован = Истина;		
		ИначеЕсли ТипЗнч(Контекст) = Тип("Структура") Тогда
			АдресСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст, "АдресСхемы");
			Если Не ЭтоАдресВременногоХранилища(АдресСхемы) Тогда 
				Контекст.Вставить("АдресСхемы", ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор));
			КонецЕсли;
		КонецЕсли;
		
		Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.УстановитьСтандартныеНастройки(
			ЭтотОбъект, ФиксированныеПараметры, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
	Иначе
		Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.УстановитьФиксированныеПараметры(
			ЭтотОбъект, ФиксированныеПараметры, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
	КонецЕсли;
		
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДоступныеЗначения", ДоступныеЗначения);
	
	Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.УстановитьСтандартныйЗаголовокОтчета(
		Контекст, НовыеНастройкиКД, ФиксированныеПараметры, ДоступныеЗначения);

КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда 
		Возврат;
	КонецЕсли;
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры", СвойстваГруппы);
	
	ФиксированныеПараметры = Новый Структура("Период, НастройкаОтчета");
	ШиринаПоля = Новый Структура("НастройкаОтчета", 35);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			Или Не ФиксированныеПараметры.Свойство(ЭлементНастройки.Параметр) Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = "ФиксированныеПараметры";
		
		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
Функция ДанныеПоИсточнику(ПараметрыНастойки)
	
	Перем НаборДанных;
	
	Период					 = ПараметрыНастойки.Период;
	НастройкаОтчета			 = ПараметрыНастойки.НастройкаОтчета;
	ОтборыИсточника			 = ПараметрыНастойки.ОтборыИсточника;
	ПараметрыИсточника		 = ПараметрыНастойки.ПараметрыИсточника;
	НастройкаПулаПодключений = ПараметрыНастойки.НастройкаПулаПодключений;
	Язык 					 = ПараметрыНастойки.Язык;
	ВалютаДокумента			 = ПараметрыНастойки.ВалютаДокумента;
	
	ИсточникДанных = НастройкаОтчета.ИсточникДанных;
	
	ГраницаНач = Период.ДатаНачала;
	ГраницаКон = Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая);

	ПодготовленныеПараметрыИсточника = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ПараметрыИсточника);
	ПодготовленныеПараметрыИсточника.Вставить("ВалютаДокумента", ВалютаДокумента);
	
	// бит_МеханизмПолученияДанных.КонструкторПредопределенныхПараметров()
	МакетПроизвольногоОтчета = Новый Структура;
	МакетПроизвольногоОтчета.Вставить("ВалютаДокумента", ВалютаДокумента);
	МакетПроизвольногоОтчета.Вставить("КурсДокумента", 1);
	МакетПроизвольногоОтчета.Вставить("КратностьДокумента", 1);
	МакетПроизвольногоОтчета.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	бит_МеханизмПолученияДанных.ДобавитьОбязательныеПараметрыПроизвольногоОтчета(МакетПроизвольногоОтчета, ПодготовленныеПараметрыИсточника);
	
	Если ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		СтрПар = бит_МеханизмПолученияДанных.НовыепараметрыПолучитьДанныеПоИсточнику();
		СтрПар.Параметры    = ПодготовленныеПараметрыИсточника;
		СтрПар.ОтборВОтчете = ОтборыИсточника;
		СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;			
		
		НаборДанных = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(ИсточникДанных, ГраницаНач, ГраницаКон, СтрПар);
		
	ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда	
				
		СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
		СтрПар.Параметры                = ПодготовленныеПараметрыИсточника;
		СтрПар.ОтборВОтчете             = ОтборыИсточника;
		СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;
		
		НаборДанных = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникамМП(ИсточникДанных, ГраницаНач, ГраницаКон, СтрПар);
		
		бит_МеханизмПолученияДанных.ДополнитьРезультатИВыполнитьРасчет(ИсточникДанных, НаборДанных);
		
	КонецЕсли;

	Возврат НаборДанных;
	
КонецФункции

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	ВспомогательныеПараметры.Добавить("НастройкаПулаПодключений");
	ВспомогательныеПараметры.Добавить("Язык");
	ВспомогательныеПараметры.Добавить("ВалютаДокумента");
	ВспомогательныеПараметры.Добавить("НастройкиИсточника");
	ВспомогательныеПараметры.Добавить("НастройкаОтчета");
	
	Возврат ВспомогательныеПараметры;
	
КонецФункции

Функция ОбязательныеПараметрыОтчета()

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Период", 				   	 Новый СтандартныйПериод);
	ПараметрыОтчета.Вставить("НастройкаОтчета",		   	 Справочники.бит_НастройкиОтчетов.ПустаяСсылка());
	ПараметрыОтчета.Вставить("ПараметрыИсточника",	   	 Справочники.бит_НастройкиОтчетов.НовыеПараметрыИсточника());
	ПараметрыОтчета.Вставить("ОтборыИсточника",		   	 Справочники.бит_НастройкиОтчетов.НовыеОтборыИсточника());
	ПараметрыОтчета.Вставить("НастройкаПулаПодключений", Справочники.бит_мпд_НастройкиПуловПодключений.ПустаяСсылка());
	ПараметрыОтчета.Вставить("Язык", 					 Справочники.бит_Языки.ПустаяСсылка());
	ПараметрыОтчета.Вставить("ВалютаДокумента", 		 Справочники.Валюты.ПустаяСсылка());
	ПараметрыОтчета.Вставить("НастройкиИсточника", 	   	 Справочники.бит_НастройкиОтчетов.НовыеНастройкиИсточника());
	
	Для каждого ОписаниеПараметра Из ПараметрыОтчета Цикл
		ПараметрНастройки = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, ОписаниеПараметра.Ключ);
		Если ПараметрНастройки <> Неопределено Тогда
			ПараметрыОтчета[ОписаниеПараметра.Ключ] = ПараметрНастройки.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(ПараметрыОтчета.НастройкиИсточника) = Тип("ХранилищеЗначения") Тогда
		НастройкиИсточника = ПараметрыОтчета.НастройкиИсточника.Получить();
		Если ТипЗнч(НастройкиИсточника) = Тип("Структура") Тогда
			ПараметрыОтчета.ПараметрыИсточника = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиИсточника,
													"ПараметрыИсточника", ПараметрыОтчета.ПараметрыИсточника);
			ПараметрыОтчета.ОтборыИсточника = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиИсточника,
												"ОтборыИсточника", ПараметрыОтчета.ОтборыИсточника);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыОтчета;
	
КонецФункции

#КонецОбласти

#КонецЕсли
